# core/ai_service.py
import asyncio

class AIService:
    def __init__(self):
        # Список жестко заданных вопросов (имитация)
        self.scripted_questions = [
            "Как давно у вас появились эти симптомы?",
            "Оцените боль по шкале от 1 до 10.",
            "Есть ли у вас хронические заболевания?",
            "Принимаете ли вы сейчас какие-то лекарства?"
        ]

    async def get_next_question(self, history: list[str]) -> str | None:
        """
        Возвращает следующий вопрос из списка.
        Если вопросов больше нет - возвращает None.
        """
        # Считаем, сколько вопросов уже было (минус 1, так как первое - это жалоба пациента)
        # history = ["Жалоба: болит", "Ответ 1", "Ответ 2"]
        answers_count = len(history) - 1
        
        if answers_count < len(self.scripted_questions):
            return self.scripted_questions[answers_count]
        
        return None

    async def analyze_anamnesis(self, history: list[str]) -> str:
        """
        Имитация анализа.
        """
        
        return (
            "🤖 **Предварительный анализ (Тестовый режим):**\n"
            "Пациент заполнил опросник. Требуется консультация терапевта.\n"
            "Приоритет: Стандартный."
        )